# Athour:Mr Xie
# 开发时间:2021/12/14 20:02
#一维数组索引、切片
import numpy as np
x = np.arange(10,18)
print(x)
x[2:4]=8,8 #原地修改，序列解包赋值
print(x)
# 修改指定位置上的元素值
x.put(0,9)#x.put(索引，数据)
print(x)

x = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(x)#0-2行，0-2列
x[2,]=1#第2行全为1
print(x)
x[0,2]=4 #第0行第2列元素为4
print(x)

print(x[0])#第0行元素
print(x[0][0])      # 第0行第0列的元素值
print(x[0,2])       # 第0行第2列的元素值
print(x[[0,1], [1,2]])   #第0行第1列的元素和第1行第2列的元素

#数组与数值的运算
print('--------数组与数值的运算---------')
x = np.array((1, 2, 3, 4, 5))    # 创建数组对象
print(x)
print(x*2)      #数组与数值相乘，返回新数组
print(x/2)      # 数组与数值相除,真除法
print(x//2)     # 数组与数值整除,商的整数部分
print(x**3)    # 幂运算
print(x+2)      # 数组与数值相加
print(x%3)      # 商的余数部分

#numpy两个数组的相加、相减以及相乘都是对应元素之间的操作。
a = np.array((1, 2, 3))
b = np.array(([1, 2, 3], [4, 5, 6], [7, 8, 9]))
c=a*b            # 数组与数组相乘
print(c)         # a中的每个元素乘以b中的对应行的对应列元素

print('-----------')
print(c/b)
print(c/a)
print('-----------')

#转置
b = np.array([[1,2,3],[4,5,6],[7,8,9]])
print(b)
print(b.T) #转置
# 一维数组转置以后和原来是一样的

'''
比较运算：>、<、==、>=、<=、!=。比较运算返回的结果是一个布尔数组，每个元素为每个数组对应元素的比较结果。
逻辑运算：
np.any函数表示逻辑“or”
np.all函数表示逻辑“and”
'''
a=np.arange(12).reshape(3,4)
print(a)
print(a>5)
print(np.all(a<12))
print(np.any(a<5))
print(a[a<5])# 获取数组中小于5的元素，可用于检测和过滤异常值

